src_ext/Catalogs/УЗ_ФизЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>УЗ_ФизЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возраст</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>EMail</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Фото</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Http</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоEmail</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоSMS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОповеститьПоТелефону</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаПедагога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_СтавкиПедагогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникИнформации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.УЗ_ИсточникиИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Родитель1</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_ФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Comment>Составной тип: пустое значение (Неопределено) — пол не указан; Булево пустым не бывает</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Статусы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заметки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоВыбранныеГруппыОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПедагог</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выбыл</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УЗ_Тарифы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГруппыОбучения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаОбучения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УЗ_ГруппыОбучения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_ext/Catalogs/УЗ_ФизЛица/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Перем ЗарплатаДоступна;	//видна ли ставка педагога (роль руководителя); спрашивается у сервера один раз

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Объект.Ссылка.Пустая() Тогда
		//«(создать)» из поля Родитель/Ученик: папка по имени предопределённой группы и набранное ФИО
		Если ТипЗнч(Параметры.Ключ2) = Тип("Структура") Тогда
			Если Параметры.Ключ2.Свойство("Группа")
				И Справочники.УЗ_ФизЛица.ПолучитьИменаПредопределенных().Найти(Параметры.Ключ2.Группа) <> Неопределено Тогда
				Объект.Родитель = Справочники.УЗ_ФизЛица[Параметры.Ключ2.Группа];
			КонецЕсли;
			Если Параметры.Ключ2.Свойство("Наименование") И ПустаяСтрока(Объект.Наименование) Тогда
				Объект.Наименование = Параметры.Ключ2.Наименование;
			КонецЕсли;
		КонецЕсли;
		//создают в папке «Педагоги» — это педагог
		Если Не Объект.ЭтоПедагог И ЭтоПапкаПедагогов(Объект.Родитель) Тогда
			Объект.ЭтоПедагог = Истина;
		КонецЕсли;
	КонецЕсли;
	//возраст не хранится при известной дате рождения — показываем вычисленный на сегодня
	РассчитатьВозраст();

КонецПроцедуры

//Папка «Педагоги» или вложенная в неё.
&НаСервереБезКонтекста
Функция ЭтоПапкаПедагогов(Папка)

	Педагоги = Справочники.УЗ_ФизЛица.Педагоги;
	Текущая = Папка;
	Пока ЗначениеЗаполнено(Текущая) Цикл
		Если Текущая = Педагоги Тогда
			Возврат Истина;
		КонецЕсли;
		Текущая = Текущая.Родитель;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

&НаКлиенте
Процедура КорневаяПапкаПриИзменении(Элемент)
	//перенесли нового в папку «Педагоги» — отметить педагогом
	Если Объект.Ссылка.Пустая() И Не Объект.ЭтоПедагог И ЭтоПапкаПедагогов(Объект.Родитель) Тогда
		Объект.ЭтоПедагог = Истина;
		ОбновитьВидимостьЭлементов();
	КонецЕсли;
КонецПроцедуры

#Region Работа_с_фото

Процедура ПоказатьКартинки()
	
	Если НЕ Объект.Фото.Пустая() Тогда
		Фото = ПоместитьВоВременноеХранилище(Объект.Фото.Файл.Получить());
	Иначе
		Фото = "";
	КонецЕсли;
	//нет фото — нет пустой рамки (остаётся ссылка «Выбрать фото»)
	Элементы.Фото.Видимость = ЗначениеЗаполнено(Фото);

КонецПроцедуры
&НаКлиенте
Процедура ВыбратьФото(Команда)	
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыборФайла",ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение,,,Истина,УникальныйИдентификатор);	
КонецПроцедуры
&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Не Результат Тогда
		Возврат;
	КонецЕсли;
	
	Фото = Адрес;
	Элементы.Фото.Видимость = Истина;

	ЗаписатьНовуюКартинкуНаСервере();
	
КонецПроцедуры
Процедура ЗаписатьНовуюКартинкуНаСервере()
	
	Если Объект.Фото.Пустая() Тогда
		НовыйФайлКартинки = Справочники.УЗ_Фото.СоздатьЭлемент();
	Иначе
		НовыйФайлКартинки = Объект.Фото.ПолучитьОбъект();
	КонецЕсли; 
	
	НовыйФайлКартинки.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	НовыйФайлКартинки.Наименование = Объект.Наименование;
	
	Попытка
		НовыйФайлКартинки.Записать();
		Если Объект.Фото.Пустая() Тогда
			Объект.Фото = НовыйФайлКартинки.Ссылка;
		КонецЕсли;
	Исключение
		Сообщить("Не удалось сохранить фотографию! " +ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры 	
&НаКлиенте
Процедура ФотоОбъектОчистка(Элемент, СтандартнаяОбработка)
	Фото = Неопределено;
	Элементы.Фото.Видимость = Ложь;
КонецПроцедуры
&НаКлиенте
Процедура ФотоПриИзменении(Элемент) 	
	ПоказатьКартинки();
КонецПроцедуры

#EndRegion


//Расчет возраста
&НаКлиенте 
Процедура ДатаРожденияПриИзменении(Элемент)
	
	РассчитатьВозраст();
	
КонецПроцедуры

//Возраст — полных лет на сегодня от даты рождения (УЗ_ОбщийКлиентСервер.ВозрастНаДату; при записи карточки он не
//хранится, если дата рождения известна). Без даты рождения — введённый вручную.
&НаСервере
Процедура РассчитатьВозраст()

	Если ЗначениеЗаполнено(Объект.ДатаРождения) Тогда
		Объект.Возраст = УЗ_ОбщийКлиентСервер.ВозрастНаДату(Объект.ДатаРождения, ТекущаяДатаСеанса());
	КонецЕсли;

КонецПроцедуры
//Конец расчет возраста


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Оповестить(Объект.Ссылка);
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура ДекорацияСсылкаHttpНажатие(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Http) Тогда
		ПерейтиПоНавигационнойСсылке(Объект.Http);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура РодительСоздание(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//набранное ФИО целиком — в наименование новой карточки
	ПараметрыСтроки = Новый Структура;
	ПараметрыСтроки.Вставить("Наименование", СокрЛП(Элемент.ТекстРедактирования));
	ПараметрыСтроки.Вставить("Группа","Родители");
	
	Пар = Новый Структура("Ключ2", ПараметрыСтроки);
	
	ОткрытьФорму("Справочник.УЗ_ФизЛица.Форма.ФормаЭлемента",Пар,ЭтотОбъект,ЭтаФорма.УникальныйИдентификатор,ВариантОткрытияОкна.ОтдельноеОкно,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВзаиморасчеты(Команда)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьВзаиморасчетыНаКлиенте();
	
КонецПроцедуры
Функция ОткрытьВзаиморасчетыНаСервере()
	
	КомпоновщикНастроек = Отчеты.УЗ_Взаиморасчеты.Создать().КомпоновщикНастроек; 
	Настройки 			= КомпоновщикНастроек.Настройки; 
	
	ЭлементНастройки = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")); 
	//ЭлементНастройки.Значение.ДатаНачала    = '00010101';//НачалоГода(ТекущаяДата());
	//ЭлементНастройки.Значение.ДатаОкончания = '00010101';//КонецГода(ТекущаяДата());
	Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда 
		ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки); 
		Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда 
			//ПользовательскийПараметр.Значение = ЭлементНастройки.Значение;
			ПользовательскийПараметр.Использование = Ложь;
		КонецЕсли; 
	КонецЕсли; 
	
	Если Объект.ЭтоПедагог Тогда
		ОтборФизЛицо = Новый ПолеКомпоновкиДанных("Педагог");
	Иначе   		
		ОтборФизЛицо = Новый ПолеКомпоновкиДанных("Клиент");
		//ОтборПериод = Новый ПолеКомпоновкиДанных("Период");
	КонецЕсли;

	ОтборТариф = Новый ПолеКомпоновкиДанных("Тариф");
	
	Для Каждого ЭлементНастройки Из Настройки.Отбор.Элементы Цикл 
		Если ЭлементНастройки.ЛевоеЗначение = ОтборФизЛицо Тогда 
			ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
			ЭлементНастройки.ПравоеЗначение = Объект.Ссылка; 
			ЭлементНастройки.Использование = Истина; 
			Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда 
				ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки); 
				Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда 
					ПользовательскийПараметр.ВидСравнения = ЭлементНастройки.ВидСравнения; 
					ПользовательскийПараметр.ПравоеЗначение = ЭлементНастройки.ПравоеЗначение; 
					ПользовательскийПараметр.Использование = ЭлементНастройки.Использование; 
				КонецЕсли; 
			КонецЕсли;
			Если НЕ ЗначениеЗаполнено(Объект.Тариф) Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.Тариф) Тогда
			Если ЭлементНастройки.ЛевоеЗначение = ОтборТариф Тогда 
				ЭлементНастройки.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; 
				ЭлементНастройки.ПравоеЗначение = Объект.Ссылка.Тариф; 
				ЭлементНастройки.Использование = Истина; 
				Если ЗначениеЗаполнено(ЭлементНастройки.ИдентификаторПользовательскойНастройки) Тогда 
					ПользовательскийПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(ЭлементНастройки.ИдентификаторПользовательскойНастройки); 
					Если ТипЗнч(ПользовательскийПараметр) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда 
						ПользовательскийПараметр.ВидСравнения = ЭлементНастройки.ВидСравнения; 
						ПользовательскийПараметр.ПравоеЗначение = ЭлементНастройки.ПравоеЗначение; 
						ПользовательскийПараметр.Использование = ЭлементНастройки.Использование; 
					КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	ПараметрыОткрытия = Новый Структура(); 
	ПараметрыОткрытия.Вставить("СформироватьПриОткрытии", Истина); 
	ПараметрыОткрытия.Вставить("Вариант", Настройки); 
	ПараметрыОткрытия.Вставить("ПользовательскиеНастройки", КомпоновщикНастроек.ПользовательскиеНастройки); 
	
	Возврат ПараметрыОткрытия;
	
КонецФункции
&НаКлиенте
Процедура ОткрытьВзаиморасчетыНаКлиенте()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		ПараметрыОткрытия = ОткрытьВзаиморасчетыНаСервере();
		ОткрытьФорму("Отчет.УЗ_Взаиморасчеты.Форма", ПараметрыОткрытия, ЭтаФорма);
	Иначе
		ОткрытьФорму("Отчет.УЗ_Взаиморасчеты.Форма", , ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

/////Цвет
&НаКлиенте
Процедура ПриНажатииКнопкиВыборЦвета(Команда)
	
	Кнопка = ЭтаФорма.ТекущийЭлемент;
	
	Обработчик = Новый ОписаниеОповещения("ПриВыбореWebЦвета", ЭтаФорма);
	Режим = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
	ДопПарам = Новый Структура("ИмяКнопки", Кнопка.Имя);
	
	//Форма текущей демо обработки
	ОткрытьФорму("Обработка.УЗ_ВыборWebЦвета.Форма.ПалитраWebЦветовУправляемая", ДопПарам,,,,, Обработчик, Режим);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореWebЦвета(ВыбраныйWebЦвет, ДополнительныеПараметры) Экспорт
	
	//Обработка выбора цветв
	Если НЕ ВыбраныйWebЦвет = Неопределено Тогда
		//в справочнике — ключ WebЦвета (общая функция, та же у помещений и предметов): имя, собранное из
		//представления («Королевскийголубой»), в WebЦвета не находилось, и карточка падала при открытии
		Объект.Цвет = УЗ_ОбщийКлиентСервер.ИмяWebЦвета(ВыбраныйWebЦвет);
		Модифицированность = Истина;
		ПоказатьЦвет();
	КонецЕсли;

КонецПроцедуры

//Цвет педагога на кнопке: сохранённое имя читается общей функцией — и ключ WebЦвета, и старые имена;
//неизвестное имя — кнопка без цвета, карточка не падает (было: WebЦвета[Объект.Цвет] — ошибка).
&НаКлиенте
Процедура ПоказатьЦвет()

	ЗначениеЦвета = УЗ_ОбщийКлиентСервер.WebЦветПоИмени(Объект.Цвет);
	Элементы.ПриНажатииКнопкиВыборЦвета.ЦветФона = ЗначениеЦвета;
	Если ЗначениеЦвета <> Новый Цвет Тогда
		Элементы.ПриНажатииКнопкиВыборЦвета.Заголовок = УЗ_ОбщийКлиентСервер.ИмяЦветаСловами(ЗначениеЦвета);
	КонецЕсли;

КонецПроцедуры
/////Цвет

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ОбновитьВидимостьЭлементов(); 	
КонецПроцедуры

&НаКлиенте
Процедура ВозрастПриИзменении(Элемент)
	Объект.ДатаРождения = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница2 Тогда
		
		Если Объект.Ссылка.Пустая() Тогда
			Кл = Неопределено;
		Иначе
			Кл = Объект.Ссылка;	
		КонецЕсли;
		
		Если Объект.ЭтоПедагог Тогда
			Документы.Параметры.УстановитьЗначениеПараметра("Клиент", Неопределено);
		Иначе
			Документы.Параметры.УстановитьЗначениеПараметра("Клиент", Кл);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

//Остатки денег ученика по организациям (В12, как взаиморасчёты в типовых): строки «организация × предмет» —
//УЗ_Сервер.ОстаткиДенегУченика, итог — по каждой организации через УЗ_Сервер.ОстатокДенегУченика (та же функция,
//что в уроке, ПКО и панели ученика). Аванс 8 000 в А и долг 1 000 в Б — «А: +8 000,00; Б: -1 000,00», а не общие
//+7 000. Блок «по тарифу» — Справочники.УЗ_ФизЛица.ОстатокПоТарифу в организации остатков списков (настройки учёта):
//цена тарифа на сегодня (история цен, В8), без деления на ноль.
&НаСервере
Процедура ЗаполнитьИтоги()

	Если Объект.Ссылка.Пустая() Или Объект.ЭтоПедагог Тогда
		Возврат;
	КонецЕсли;

	Долги.Очистить();
	Организации = Новый Массив;
	Для Каждого СтрокаОстатка Из УЗ_Сервер.ОстаткиДенегУченика(Объект.Ссылка) Цикл
		НоваяСтрока = Долги.Добавить();
		НоваяСтрока.Организация = СтрокаОстатка.Организация;
		НоваяСтрока.Предмет = СтрокаОстатка.ПредметОбучения;
		НоваяСтрока.Долг = СтрокаОстатка.Остаток;
		Если Организации.Найти(СтрокаОстатка.Организация) = Неопределено Тогда
			Организации.Добавить(СтрокаОстатка.Организация);
		КонецЕсли;
	КонецЦикла;
	Элементы.ДолгиОрганизация.Видимость = Организации.Количество() > 1;

	Части = Новый Массив;
	ЕстьДолг = Ложь;
	Для Каждого Организация Из Организации Цикл
		Остаток = УЗ_Сервер.ОстатокДенегУченика(Объект.Ссылка, Организация);
		ЕстьДолг = ЕстьДолг Или Остаток < 0;
		Части.Добавить(?(Организации.Количество() > 1, Строка(Организация) + ": ", "") + ОстатокСтрокой(Остаток));
	КонецЦикла;
	Элементы.ДекорацияЗадолженность.Заголовок = СтрСоединить(Части, "; ");
	Элементы.ДекорацияЗадолженность.ЦветТекста = ?(ЕстьДолг, WebЦвета.ТемноОранжевый, WebЦвета.ТемноЗеленый);

	ОстатокДенегПоТарифу = "";
	ОстатокЕдиницПоТарифу = 0;
	ВсегоУроковПоТарифу = 0;
	ВсегоЯвокПоТарифу = 0;
	Если ЗначениеЗаполнено(Объект.Тариф) Тогда
		ПоТарифу = Справочники.УЗ_ФизЛица.ОстатокПоТарифу(Объект.Ссылка, Объект.Тариф, УЗ_Сервер.ОрганизацияОстатков());
		Если ПоТарифу.Остаток <> 0 Тогда
			ОстатокДенегПоТарифу = ОстатокСтрокой(ПоТарифу.Остаток);
			Элементы.ОстатокДенегПоТарифу1.ЦветТекста = ?(ПоТарифу.Остаток > 0, WebЦвета.ТемноЗеленый, WebЦвета.ТемноОранжевый);
		КонецЕсли;
		Если ПоТарифу.Единиц <> Неопределено Тогда
			ОстатокЕдиницПоТарифу = ПоТарифу.Единиц;
		КонецЕсли;
		Элементы.ОстатокЕдиницПоТарифу.Заголовок = ?(ПоТарифу.ЕдиницаИзмерения = НСтр("ru = 'ч'"),
			НСтр("ru = 'Осталось часов'"), НСтр("ru = 'Осталось уроков'"));
		ВсегоУроковПоТарифу = ПоТарифу.Уроков;
		ВсегоЯвокПоТарифу = ПоТарифу.Явок;
	КонецЕсли;

КонецПроцедуры

//«+8 000,00» — оплачено вперёд, «-1 000,00» — долг.
&НаСервереБезКонтекста
Функция ОстатокСтрокой(Остаток)
	Возврат ?(Остаток > 0, Формат(Остаток, "ЧДЦ=2; ЧФ=+Ч"), Формат(Остаток, "ЧДЦ=2; ЧН=0,00"));
КонецФункции
&НаКлиенте
Процедура ОткрытьВзаиморасчетыНаКлиенте2(Элемент) 	
	ОткрытьВзаиморасчетыНаКлиенте();	
КонецПроцедуры 

&НаКлиенте
Процедура ЭтоПедагогПриИзменении(Элемент)
	//новый педагог — в папку «Педагоги» (поле папки у педагога скрыто); сняли флажок — из папки педагогов убрать
	Если Объект.Ссылка.Пустая() Тогда
		ВПапкеПедагогов = ЭтоПапкаПедагогов(Объект.Родитель);
		Если Объект.ЭтоПедагог И Не ВПапкеПедагогов Тогда
			Объект.Родитель = ПредопределенноеЗначение("Справочник.УЗ_ФизЛица.Педагоги");
		ИначеЕсли Не Объект.ЭтоПедагог И ВПапкеПедагогов Тогда
			Объект.Родитель = ПредопределенноеЗначение("Справочник.УЗ_ФизЛица.ПустаяСсылка");
		КонецЕсли;
	КонецЕсли;
	ОбновитьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВидимостьЭлементов()

	ПоказатьЦвет();

	ЗаполнитьИтоги();
	
	Если Объект.ЭтоПедагог Тогда		
		Элементы.Родитель.Видимость = Ложь;
		//Элементы.ГруппаГруппыОбучения.Видимость = Ложь;
		//ставка педагога — только руководителю (у менеджера нет права на зарплату)
		Если ЗарплатаДоступна = Неопределено Тогда
			ЗарплатаДоступна = ДоступнаЗарплата();
		КонецЕсли;
		Элементы.СтавкаПедагога.Видимость = ЗарплатаДоступна;
		Элементы.Скидка.Видимость = Ложь;
		Элементы.Тариф.Видимость = Ложь;
	Иначе
		Элементы.Родитель.Видимость = Истина;
		//Элементы.ГруппаГруппыОбучения.Видимость = Истина;
		Элементы.СтавкаПедагога.Видимость = Ложь;
		Элементы.Скидка.Видимость = Истина;
		Элементы.Тариф.Видимость = Истина;
	КонецЕсли;
	
	ПоказатьКартинки();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ДоступнаЗарплата()
	Возврат УЗ_Общий.ДоступнаЗарплата();
КонецФункции

&НаКлиенте
Процедура ДолгиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОткрытьВзаиморасчетыНаКлиенте();
КонецПроцедуры


&НаКлиенте
Процедура ТарифПриИзменении(Элемент)
	ОбновитьВидимостьЭлементов();
КонецПроцедуры


&НаКлиенте
Процедура ОстатокДенегПоТарифуНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОткрытьВзаиморасчетыНаКлиенте();
	
КонецПроцедуры


&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Документы.ТекущиеДанные;
	Если ТекДанные <> Неопределено И ЗначениеЗаполнено(ТекДанные.Документ) Тогда
		ПоказатьЗначение(, ТекДанные.Документ);
	КонецЕсли;
	
КонецПроцедуры
